# 1: მომხმარებელს შეაყვანინეთ წლის რიცხვი. 
# პროგრამამ უნდა დააბრუნოს True, თუ ეს წელი ან 2024-ია, ან 2025, ან 2026.
# სხვა შემთხვევაში უნდა დააბრუნოს False.

year = input("შეიყვანეთ წლის რიცხვი: ")
print(year =="2024" or year == "2025" or year == "2026")

# 2: მომხმარებელს შეაყვანინეთ მთელი რიცხვი.
# პროგრამამ უნდა დააბრუნოს True, თუ რიცხვი ერთდროულად ლუწიცაა და სამზეც იყოფა.
# სხვა შემთხვევაში უნდა დააბრუნოს False.

num = int(input("შეიყვანეთ მთელი რიცხვი: "))
print(num % 2 == 0 and num % 3 == 0)