# HOMEWORK:
num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
result = num1 * num2
print("შედეგი :  {result}")

#2)შენი ამოცანაა, შექმნა პროგრამა, რომელიც მომხმარებელს სთხოვს ტექსტის შეყვანას და განსაზღვრავს, რამდენჯერ უნდა გაიმეოროს ეს ტექსტი. პროგრამამ უნდა გამოაჩინოს შედეგი იმავე სტრიქონზე (ან თუ გინდა, შეგიძლია გააკეთო ისე, რომ ყოველი გამეორება ახალ ხაზზე დაიბეჭდოს). 




text = input("შეიყვანეთ ტექსტი: ")
repeat_count = int(input("რამდენჯერ გავიმეოროთ ტექსტი? "))
print((text + " ") * repeat_count)







