# CLASSWORK
# დავალება:
# შექმენი რიცხვების სია.
# შეამოწმე, აქვს თუ არა სია ლუწი რიცხვები და კენტი რიცხვები, და დაბეჭდე "ლუწია" ან "კენტია" თითოეული რიცხვისთვის.
list = [1,2,3,4,5,6,7,8,9,10,45,0,8]
for num in list: 
    if num % 2== 0:
        print(f'{num}ლუწია ')
    elif num % 2 != 0 :
        print(f'{num}კენტია ')


# დავალება 2: რიცხვების დამახარისხება ლუწებად და კენტებად

# დავალება:
#  შექმენი რიცხვების სია და გამოაცალკევე ლუწი და კენტი  რიცხვები. დაბეჭდე თითოეული სია.
numbers = [10, 15, 22, 33, 40, 57, 68, 99]
even_numbers = []
odd_numbers = []
for num in numbers:
    if num % 2 == 0:
        even_numbers.append(num)
    elif num % 2 != 0:
        odd_numbers.append(num)


print('ლუწი რიცხვებია', even_numbers)
print('კენტი რიცხვები',odd_numbers) 