# დავალება 1)გამარჯობა ხუთჯერ
# დავალება: დაწერე პროგრამა, რომელიც 5-ჯერ ამობეჭდავს „გამარჯობა“.
for i in range(5):
    print("გამარჯობა ") 

# დავალება 2) კომენტარის სახით ახსენი for loop და მოიყვანე მაგალითები
    
#for loop- გამოიყენება იმისთვის რომ ბევრი წვალების გარეშ შეგვიძლია წინადადება გამოვიტანოთ ბევრჯერ მაგალითად :
for i in  range(5):
    print("hello world ")
#for და in არის იგივე loop-ის keyword
#ხოლო i არის ცვლადი რომელიც იცვლება ყოველი
#range-არის თუ რამდენჯერ უნდა გამოვიტანოთ ეს სითყვა
#სთუ კარგად დააკვირდებით დაინახავთ : ეს  ორწერტილი იწყებს loop-ის გადანერგვას
#იტერაცია არის გამეორება 
 

for i in range(0, 50+1, +2):
    print(i)

# დავალება 3. ლუწი რიცხვების ამობეჭდვა 2-დან 10-მდე
# დავალება: დაწერეთ პროგრამა, რომელიც ამობეჭდავს ლუწ რიცხვებს 2-დან 10-მდე.
for i in range(2, 10+1 , +2):
    print(i)