# CLASSWORK
# 1: შექმენით პროგრამა, რომელიც მომხმარებელს შეაყვანინებს რიცხვს.
# პროგრამამ უნდა დააბრუნოს True, თუ რიცხვი დადებითია, ხოლო False, თუ რიცხვი უარყოფითია ან ნულია.
num =int(input('შეიყვანე რიცხვი: '))
print(num >= 0)

# 2: მომხმარებელს შეაყვანინეთ ასაკი და მოქალაქეობა.
# პროგრამამ უნდა დააბრუნოს True, თუ პირი არის 18 ან მეტი წლის და საქართველოს მოქალაქეა, წინააღმდეგ შემთხვევაში False.
age=int(input("შიყვანეთ თქვენი ასაკი: "))
city=input('შეიყვანე მოქალაქეობა: ')
print(age>=18 and city=="საქართველო")