# HOMEWORK
# დაწერე პროგრამა, რომელიც მომხმარებელს სთხოვს სიმბოლოს და რიცხვის შეყვანას. პროგრამამ უნდა დაბეჭდოს პირამიდის მსგავსი სტრუქტურა მოცემული სიმბოლოს გამოყენებით. მაგალითად, თუ მომხმარებელი შეიყვანს *-სა და 4-ს:

symbol = input("შეიყვანეთ სიმბოლო: ")
height = int(input("შეიყვანეთ რიცხვი (პირამიდის სიმაღლე): "))
line1 = ' ' * (height - 1) + symbol * (2 * 1 - 1)
line2 = ' ' * (height - 2) + symbol * (2 * 2 - 1)
line3 = ' ' * (height - 3) + symbol * (2 * 3 - 1)
line4 = ' ' * (height - 4) + symbol * (2 * 4 - 1)

print(line1)
print(line2)
print(line3)
print(line4)