# მაგიური სიტყვა – სანამ მომხმარებელი სწორ სიტყვას არ შეიყვანს, პროგრამა არ შეწყდება 
მაგიურისიტყვა="goa is the best"
guess=input("შიყვანე მაგიური სიტყვა: ")
while guess.lower() != მაგიურისიტყვა:
   guess =input("მაგიური სიტყვა არასწორია, სცადეთ კიდევ: ")
print("მაგიური სიტყვა სწორია")

#  დავალება 2):
#  პირობა:
# დაწერე Python პროგრამა, რომელიც სთხოვს მომხმარებელს გამოიცნოს საიდუმლო ფერი.

# პროგრამა მომხმარებელს აძლევს შესაძლებლობას, შეიყვანოს ფერი.
# სანამ მომხმარებელი სწორ ფერს არ შეიყვანს, პროგრამა არ შეწყდება.
# როდესაც სწორი ფერი შეიყვანება, პროგრამა დაბეჭდავს გამარჯვების შეტყობინებას. 
საიდუმლოფერი="ყავისფერი"
guess=input("შეიყვანე საიდუმლო ფერი: ")
while guess != საიდუმლოფერი:
   guess =input("საიდუმლო ფერი არასწორია, გთხოვთ სცადეთ კიდევ: ")
print("შენ გამოიცანი საიდუმლო სიტყვა")