# HOMEWORK

# დავალება 1. რიცხვების კლების დაბეჭდვა (10-დან 1-მდე, მხოლოდ კენტები)
# დავალება: დაწერე პროგრამა, რომელიც დაბეჭდავს 10-დან 1-მდე მხოლოდ კენტ რიცხვებს (კლებადობით). 
# -------
for i in range(10+1, 0 ,-2):
    print(i)


# დავალება 2.
# კვადრატების გამოთვლა და ჯამი (1-დან 7-მდე)
# დავალება: დაწერე პროგრამა, რომელიც 1-დან 7-მდე რიცხვების კვადრატებს დაბეჭდავს და საბოლოოდ გამოთვლის მათ ჯამს. 
# -----
    total=0 
for i in range(1,8): 
    square=i**2 
    print(i)
    total+=square
print("ჯამი",total)


# დავალება 3.
# რიცხვების კუბის გამოთვლა და ჯამი (1-დან 10-მდე)
# დავალება: დაწერე პროგრამა, რომელიც 1-დან 10-მდე რიცხვების კუბებს  ამობეჭდავს და საბოლოოდ გამოთვლის მათ ჯამს.
total=0
for i in range(1,10):
    square=i**3
    print(i)    
    total+=square
    print("ჯამი ",total)