# 1:მომხმარებელმა უნდა შეიყვანოს მთელი რიცხვი, ხოლო პროგრამამ უნდა შეამოწმოს შემდეგი პირობები:

# არის თუ არა რიცხვი დადებითი.
# თუ დადებითია, არის თუ არა ლუწი.
# თუ ლუწია, არის თუ არა 3-ის ჯერადი.
# თუ 3-ის ჯერადია, არის თუ არა 7-ის ჯერადი.
# თუ 7-ის ჯერადია, არის თუ არა 11-ის ჯერადი.
# თუ 11-ის ჯერადია, არის თუ არა 13-ის ჯერადი.

# ყოველ შემთხვევაში, პროგრამამ უნდა გამოიტანოს შესაბამისი შეტყობინება.
num = int(input("შეიყვანეთ მთელი დადებითი რიცხვი: "))
    
if num <= 0:
        print("რიცხვი უნდა იყოს დადებითი!")
else:
        print("რიცხვი დადებითია.")
        
        if num % 2 == 0:
            print("რიცხვი ლუწია.")
            if num % 3 == 0:
                print("რიცხვი 3-ის ჯერადია.")
                if num % 7 == 0:
                    print("რიცხვი 7-ის ჯერადია.")
                    if num % 11 == 0:
                        print("რიცხვი 11-ის ჯერადია.")
                        if num % 13 == 0:
                            print("რიცხვი 13-ის ჯერადია.")
                        else:
                            print("რიცხვი არ არის 13-ის ჯერადი.")
                    else:
                        print("რიცხვი არ არის 11-ის ჯერადი.")
                else:
                    print("რიცხვი არ არის 7-ის ჯერადი.")
            else:
                print("რიცხვი არ არის 3-ის ჯერადი.")
        else:
            print("რიცხვი კენტია.")  