# 1:მომხმარებელმა უნდა შეიყვანოს მთელი რიცხვი, ხოლო პროგრამამ უნდა შეამოწმოს შემდეგი პირობები:

# არის თუ არა რიცხვი დადებითი.
# თუ დადებითია, არის თუ არა ლუწი.
# თუ ლუწია, არის თუ არა 3-ის ჯერადი.
# თუ 3-ის ჯერადია, არის თუ არა 7-ის ჯერადი.
# თუ 7-ის ჯერადია, არის თუ არა 11-ის ჯერადი.
# თუ 11-ის ჯერადია, არის თუ არა 13-ის ჯერადი.

# ყოველ შემთხვევაში, პროგრამამ უნდა გამოიტანოს შესაბამისი შეტყობინება.

num = int(input("შეიყვანეთ მთელი რიცხვი: "))
    
if num <= 0:
        print("რიცხვი არ არის დადებითი: ")
else:
    print("რიცხვი დადებითია ")
        
    if num % 2 == 0:
        print("რიცხვი ლუწია ")
    else:
        print("რიცხვი არ არის ლუწი ")     
        if num % 3 == 0:
            print("რიცხვი 3-ის ჯერადია ")
        else:
            print("რიცხვი არ არის 3-ის ჯერადი ")    
            if num % 7 == 0:
                print("რიცხვი 7-ის ჯერადია ")
            else:
                print("რიცხვი არ არის 7-ის ჯერადი ")
                if num % 11 == 0:
                    print("რიცხვი 11-ის ჯერადია ")
                else:
                    print("რიცხვი არ არის 11-ის ჯერადი ")
                    if num % 13 == 0:
                        print("რიცხვი 13-ის ჯერადია ")
                    else:
                        print("რიცხვი არ არის 13-ის ჯერადი ")