# CLASSWORK
# დავალება 1:
# დაბეჭდე რიცხვები 1 დან 10 ის ჩათვლით while loop ის გამოყენებით 

number = 1
while number <= 10 :
    print(number)
    number += 1

# დავალება 2:
# გამოთვალე ყველა რიცხვის ჯამი 1 - დან 100 - მდე
    
i = 1
total = 0
while i <= 100 :
    total+=i
    i+=1
print(total)
    
# დავალება 3:
# დაბეჭდე 1- დან 50 მდე ყველა კენტი რიცხვი while loop ის გამოყენებით 

number = 1
while number <=50 :
    print(number)
    number += 2

# დავალება 4:
# მომხმარებელს შემოატანინეთ რიცხვი, და გაიგეთ, რიცხვი დადებითია, უარყოფითი თუ ნული

num = int(input('შეიყვანე ნებისმიერი რიცხვი: ')) 
if num < 0 :
    print('ეს არის უარყოფითი რიცხვი ')
elif num > 0 :
    print('ეს არის დადებითი რიცხვი ')
else :
    print('ეს არის ნული ')