# ცვლადი
# რა არის ცვლადი Python-ში?-ცვლადი არის იგივე ყუთი რომელშიც ინახება რაღაც .


# რა განსხვავებაა int და float ტიპებს შორის?-int არის უბრალო ციფრები და float-ი არის ათწილადი.

# რა ტიპის მონაცემებია "Hello" და 3.14 Python-ში?-"hello" არის str ხოლო 3.14 არის float-თი python-ში


# რა არის elif და როდის გამოიყენება-elif არის იგივე if-ი იგივე ფუნქციებით მაგრამ როდესაც ერთხელ გამოიყენებ if-ს მეორდედ ვეღარ გამოიყენებ და ამიტომ გამოიყენებენ elif-ს.



# რა განსხვავებაა for და while ციკლებს შორის?

# რა არის break და როდის გამოიყენება ციკლებში?


# რა მნიშვნელობა აქვს Python-ში ფუნქციას?-ფუნქცია არის კოდი რომელის საშვალებითაც ნებისმიერ ადგილას შმიძლია გამოვიტანო სხვა ფუნქციები და გვეხმარება კოდის შმოკლებაში.

# რა არის ფუნქციის არგუმენტი?-არგუმენტი არის მნიშვნელობა მაგალითად იგიგვე რაც ყუთს სახელი რომ ეწეროს რო გავიგოთ რა არის მასში.

# რა განსხვავებაა return და print შორის?-return-ი გამოიყენება ფუნქციის დროს ხოლო print-ი გამოყენება შგვიძლია ყოველთვის.






# დავალება 2. დაწერეთ პროგრამა, რომელიც გამოიყენებს while ციკლს და დაბეჭდავს რიცხვებს 1-დან 5-მდე.
num=0
while num != 5:
    print(num)
    num += 1