random= str(23)
print(random)

# CLASSWORK
# პირობები დავალებების მიხედვით:
# დავალება 1: რიცხვების მიმატება
# პირობა:
# მომხმარებელი უნდა შეიყვანოს ორი რიცხვი ტექსტის სახით.
# პროგრამამ უნდა მოახდინოს მათი რიცხვად გარდაქმნა და გამოთვალოს ჯამი.
# საბოლოო შედეგი უნდა დაბეჭდოს
text1=int(input('შეიყვანე ტესტის სახით რიცხვი '))
text2=int(input('შეიყვანე ტექტის სახით რიცხვი '))
print(text1 + text2)


# დავალება 2:
# დაბადების დღის გამოთვლა
# პირობა:
# მომხმარებელმა უნდა შეიყვანოს თავისი დაბადების წელი.
# პროგრამამ უნდა გამოთვალოს მისი ასაკი მიმდინარე წლის (2024) მიხედვით.
# საბოლოოდ დაბეჭდოს მომხმარებლის ასაკი.
age=int(input('შეიყვანე შენი დაბადების წელი: '))
print(2024 -age)


# დავალება 3:
# რიცხვების შერევა
# პირობა:
# პროგრამამ უნდა მიიღოს ორი რიცხვი სტრიქონის სახით.
# გარდაქმნას თითოეული სტრიქონი რიცხვებად (integer ან float).
# დააბრუნოს შერეული რიცხვები, ანუ პირველი რიცხვის დათვლით მეორე რიცხვის მრავალგზის დამატება.
num1=int(input('შეიყვანე რიცხვი სტრიქონის სახით '))
num2=int(input('შეიყვანე რიცხვი სტრიქონის სახით '))
print(num2 * num1 )


# დავალება 4:
# სტრიქონი რიცხვში
# პირობა:
# მომხმარებელი უნდა შეიყვანოს რიცხვი როგორც სტრიქონი (მაგ. "123").
# პროგრამამ უნდა გადააქციოს ეს სტრიქონი რიცხვად (integer).
# პროგრამამ უნდა დააბრუნოს ის რიცხვი, მაგრამ 1-ით ნაკლები.

num3=int(input('შეიყვანე რიცხვი სტრიქონის სახით: '))
print(num3 - 1)